---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsReferenceLiningType
source: html/6b5964c8-9e5f-e42b-a283-368d4fce2cb7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsReferenceLiningType Property

"Lining Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsReferenceLiningType { get; }
```